In [1]:
import pandas as pd

In [6]:
# create data frame manually
my_df = pd.DataFrame({
    'ID': [101, 102, 103],
    'Name': ['Tom', 'Dick', 'Harry']
})
my_df

    ID   Name
0  101    Tom
1  102   Dick
2  103  Harry

In [10]:
# create data frame from list
my_list = [
    ['Tom', 101],
    ['Dick', 102],
    ['Harry', 103]
]
my_df = pd.DataFrame(my_list, columns = ['ID', 'Name'])
my_df

      ID  Name
0    Tom   101
1   Dick   102
2  Harry   103

In [14]:
# importing data from csv
my_df = pd.read_csv('employees_data.csv')
my_df

    Name   ID
0    Tom  101
1   Dick  102
2  Harry  103

In [13]:
# importing data from excel
transactions = pd.read_excel('grocery_database.xlsx', sheet_name = 'transactions')
transactions.head()

,customer_id,transaction_date,transaction_id,product_area_id,num_items,sales_cost
0,1,2020-04-10,435657533999,3,7,19.16
1,1,2020-04-10,435657533999,2,5,7.71
2,1,2020-06-02,436189770685,4,4,26.97
3,1,2020-06-02,436189770685,1,2,38.52
4,1,2020-06-10,436265380298,4,4,22.13